![](https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/1200px-Pandas_logo.svg.png)

# <center> LESSON 5: Introduction to PANDAS </center>

## 1. INTRODUCTION

### 1.1 What is Pandas?

`Pandas = Panel Data`

### 1.2 Installation

- Cài đặt khi tạo môi trường ảo:
```
conda create -n hanh python=3.7 pandas
```
- Cài đặt sau khi tạo xong môi trường ảo:
```
conda install pandas
```
hoặc 
```
pip install pandas
```

### 1.3 Import

In [2]:
import pandas as pd

**Reference**: 
- [Pandas Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
- [Python for Data Analysis](https://bedford-computing.co.uk/learning/wp-content/uploads/2015/10/Python-for-Data-Analysis.pdf)

## 2. BASICS

### 2.1 Objects in Pandas

- **DataFrame**: table, `pd.DataFrame()`
- **Series**: column, `pd.Series()`

![](https://media.geeksforgeeks.org/wp-content/cdn-uploads/creating_dataframe1.png)
![](https://analyticssavvy.com/wp-content/uploads/2020/05/series-and-dataframe.png)

#### 2.1.1 How to create a DataFrame

1. Tạo ra 1 DataFrame rỗng

In [4]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [5]:
type(df)

pandas.core.frame.DataFrame

2. Tạo ra 1 DataFrame từ dict

In [11]:
dict1 ={'name':['Cuong','Mai','Pha','Nghia'],
        'age':[30,25,19,39],'Uni':['Camb','Oxf','NYU','LSE']}
df1 = pd.DataFrame(dict1,index=['Stu1','Stu2','Stu3','Stu4']) #index: tạo tên cho cột Index. Với các giá trị lặp lại thì có thể thay index=[f'stu{i}' for i in range(1,5) - f để ép kiểu float - có thể ỏ đi
df1

       name  age   Uni
Stu1  Cuong   30  Camb
Stu2    Mai   25   Oxf
Stu3    Pha   19   NYU
Stu4  Nghia   39   LSE

3. Tạo ra 1 DataFrame từ list của list

In [13]:
li =[['Cuong',30,'Camb'],['Mai',25,'Oxf'],['Pha',19,'NYU'],['Nghia',39,'LSE']]
df2= pd.DataFrame(li)
df2

       0   1     2
0  Cuong  30  Camb
1    Mai  25   Oxf
2    Pha  19   NYU
3  Nghia  39   LSE

In [14]:
li =[['Cuong',30,'Camb'],['Mai',25,'Oxf'],['Pha',19,'NYU'],['Nghia',39,'LSE']]
df2= pd.DataFrame(li,columns = ['name','age','Uni'])
df2

    name  age   Uni
0  Cuong   30  Camb
1    Mai   25   Oxf
2    Pha   19   NYU
3  Nghia   39   LSE

4. Tạo ra 1 DataFrame từ zip

In [21]:
name = ['Cuong','Mai','Pha','Nghia']
age = [30,25,19,39]
Uni = ['Camb','Oxf','NYU','LSE']
df3= pd.DataFrame(list(zip(name,age,Uni)),columns = ['name','age','Uni'])
df3

    name  age   Uni
0  Cuong   30  Camb
1    Mai   25   Oxf
2    Pha   19   NYU
3  Nghia   39   LSE

5. Tạo từ 1 chuỗi numpy

In [31]:
import numpy as np
df4 = pd.DataFrame(np.linspace(1,16,16).reshape(4,4))
df4

      0     1     2     3
0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0
2   9.0  10.0  11.0  12.0
3  13.0  14.0  15.0  16.0

#### 2.1.2 How to create a Series

In [32]:
type(pd.Series({'name':['Cuong','Mai','Pha','Nghia']}))

pandas.core.series.Series

In [33]:
df2

    name  age   Uni
0  Cuong   30  Camb
1    Mai   25   Oxf
2    Pha   19   NYU
3  Nghia   39   LSE

In [34]:
df2['name']

0    Cuong
1      Mai
2      Pha
3    Nghia
Name: name, dtype: object

In [35]:
df2.name

0    Cuong
1      Mai
2      Pha
3    Nghia
Name: name, dtype: object

df2= pd.DataFrame(li,columns = ['Ho va ten','age','Uni'])
df2

In [37]:
df2.'Ho va ten'

SyntaxError: invalid syntax (Temp/ipykernel_22452/1700435649.py, line 1)

In [38]:
df2['Ho va ten']

0    Cuong
1      Mai
2      Pha
3    Nghia
Name: Ho va ten, dtype: object

### 2.2 I/O

Link: https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data

# pd.read_{ten_kieu_file}: pd.read_csv(),pd.read_excel(),pd.read_sql()
# pd.to{ten_kieu_file}: pd.to_csv(), to_excel()

In [58]:
df = pd.read_csv('Ecommerce Purchases')
#df.head(5) #df.tail(5), #df.sample(5)
df.sample(5)

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
5627,"PSC 9787, Box 1798\r\nAPO AE 95621-7606",41 tE,PM,Mozilla/5.0 (Windows NT 6.2; it-IT; rv:1.9.1.2...,"Martin, Carter and Glenn",5552727908601478,12/17,535,Discover,coxronald@rowe.com,Control and instrumentation engineer,136.105.208.190,pt,0.45
4456,"4416 Williams Fields\r\nNorth Joseph, ME 74332...",56 Eq,AM,Mozilla/5.0 (iPod; U; CPU iPhone OS 3_0 like M...,"Adams, Barker and Anderson",3158515607536365,11/20,123,American Express,emilycardenas@mooney-townsend.biz,"Engineer, technical sales",174.173.143.234,it,43.24
3076,"4001 Garza Brook\r\nPort Ryanland, IN 45617-6253",94 Yi,PM,Opera/9.20.(X11; Linux i686; en-US) Presto/2.9...,Wood-Baldwin,60452813649,08/23,532,Maestro,ttucker@hotmail.com,Outdoor activities/education manager,134.30.243.197,zh,42.05
9198,USNS Berry\r\nFPO AP 04119,28 ZE,AM,Opera/8.75.(Windows 98; sl-SI) Presto/2.9.179 ...,Patel and Sons,5319227400131912,11/24,1058,Discover,susan71@gmail.com,"Loss adjuster, chartered",76.92.155.80,el,75.46
4647,"PSC 1135, Box 9279\r\nAPO AE 10910-4748",91 mC,PM,Opera/9.37.(X11; Linux x86_64; en-US) Presto/2...,"Hunter, Castaneda and Harvey",3112081718850166,02/20,784,JCB 16 digit,jeremiah44@yahoo.com,Community education officer,100.100.30.37,fr,3.54

In [54]:
iris = pd.read_csv('iris.data',header = None)
iris.head(5)

     0    1    2    3            4
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

In [53]:
iris = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data')
iris.head(5)

   5.1  3.5  1.4  0.2  Iris-setosa
0  4.9  3.0  1.4  0.2  Iris-setosa
1  4.7  3.2  1.3  0.2  Iris-setosa
2  4.6  3.1  1.5  0.2  Iris-setosa
3  5.0  3.6  1.4  0.2  Iris-setosa
4  5.4  3.9  1.7  0.4  Iris-setosa

In [56]:
import seaborn as sns
iris2 = sns.load_dataset('iris')
iris2.head(5)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [57]:
iris.to_csv('tungnl_sample_iris.csv')

### 2.3 Indexing

Chọn tất cả các dòng (slicing):
- `loc`: location `df.loc[row_label,col_label]`, `series.loc[row_label]`
- `iloc`: index location `df.iloc[row_index,col_index]`, `series.iloc[row_index]`

Chọn 1 cell:
- `at`:  `df.at[row_label,col_label]`
- `iat`: `df.iat[row_index,col_index]`

### 2.4 Masking

### 2.5 Operations

#### 2.5.1 Groupby

![](https://blog.dask.org/images/split-apply-combine.png)

#### 2.5.2 Pivot

#### 2.5.3 Others

|Merge methods| SQL Join Name | Meaning| _merge|
|-|-|-|-|
|left| LEFT OUTER JOIN|Chỉ sử dụng keys bên trái|left_only|
|right| RIGHT OUTER JOIN|Chỉ sử dụng keys bên phải|right_only|
|outer|FULL OUTER JOIN|Sử dụng keys của cả 2 dataframes|both|
|inner|INNER JOIN|Chỉ sử dụng keys giao nhau của 2 dataframes|both|

![](https://lh3.googleusercontent.com/-n76c6dtr5sw/YBO5d-3PzGI/AAAAAAAAAh8/xiT6YIzePLEXArb8uU1f1vgg8JRXYeg8ACLcBGAsYHQ/image.png)